"""
Name: {Supisara Kongthong}
SID: {364211760017}
Group: {MIT211}

จงเขียนโปรแกรมเก็บตัวเลขที่ป้อนทางคีร์บอร์ด โดยสามารถรับค่าได้เรื่อย ๆ และจะหยุดเมื่อป้อนตัวเลขที่ซ้ำจากตัวเลขที่ป้อนเข้ามาก่อนหน้า
input: รับตัวเลขจำนวนเต็มไปเรื่อย ๆ ครั้งละ 1 จำนวน
process: ตรวจสอบว่าตัวเลขที่ัรับมาซ้ำกับตัวเลขที่ป้อนเข้ามาก่อนหน้านี้หรือไม่ ถ้าไม่ซ้ำให้บันทึกค่าไว้และรับค่าต่อ ถ้าซ้ำกับตัวเลขที่
ป้อนมาก่อนหน้านี้ให้หยุด
"""


a = []
while True:
    x = int(input())
    if x == 1:
        break
    a.append(x)
print(a)