"""
Name: {Supisara Kongthong}
SID: {364211760017}
Group: {MIT211}

จงเขียนโปรแกรมหาตัวเลขที่เลข 5 หารลงตัว จากเลข 1 ถึงตัวเลขที่ป้อนทางคีย์บอร์ด
input: รับจำนวนเต็ม 1 จำนวน
process: คำนวณหาเลขที่หารด้วย 5 ลงตัว ตั้งแต่ 1 ถึงเลขที่รับมาทางคีย์บอร์ด เพื่อให้ได้คำตอบดังนี้
จำนวนที่หารด้วย 5 ลงตัวมีกี่จำนวน
มีตัวเลขใดบ้าง
output: แสดงตัวเลขว่ามีกี่จำนวน ต่อด้วยตัวเลขที่หารลงตัวโดยแต่ละตัวคั่นด้วยเว้นวรรค เช่น

Enter number: 20
The result is 4: 5 10 15 20
"""

i = int(input("Enter number: "))
count = 0
while count < i:
    if i % 5 == 0:
        print(f'The result is : ', count)
        count = count+5