"""
Name: {นางสาวศุภิสรา คงทอง}
SID: {364211760017}
Group: {MIT211}
"""
"""
Question 1:
จงเขียนโปรแกรมรับเลขจำนวนเต็ม 0 - 9 ไปเรื่อยๆ 
โปรแกรมจะหยุดรับก็ต่อเมื่อผู้ใช้ป้อนเลขผิด เช่น ป้อนเลข 10 เลข -1 หรือเลขอื่นๆ ท
ี่อยู่นอกขอบเขต 0 – 9 เมื่อโปรแกรมหยุดรับค่า 
ให้แสดงผลว่าเลข 0 - 9 มีการป้อนเลขเข้าไปกี่ครั้ง 
และเขียนผลลัพท์ลงในไฟล์ชื่อ final1.txt 
(5 คะแนน)
"""

f = open("final1.txt", 'a')
a = [ ]
while True:
    x = int(input())
    if x == 10:
        break
    a.append(x)
f.write(str(a) + '\n')
f.close()