"""
Name: {นางสาวศุภิสรา คงทอง}
SID: {364211760017}
Group: {MIT211}
"""
"""
Question 2:
จงเขียนโปรแกรมหาตัวเลขที่เลข 3 หรือ 5 หรือ 7 หารลงตัว จากเลข 1 ถึงตัวเลขที่ป้อนทางคีย์บอร์ด 
โดยแสดงตัวเลขว่ามีกี่จำนวน ต่อด้วยตัวเลขที่หารลงตัวโดยแต่ละตัวคั่นด้วยเว้นวรรค  
และเขียนผลลัพท์ที่ได้ลงในไฟล์ชื่อ final2.txt  เช่น
Enter number: 20
The result is 8: 3 5 9 10 12 15 18 20
(5 คะแนน)
"""

f = open("final2.txt", 'a')
n = int(input("Enter number: "))
i = 1
while i <= n:
    if i%3==0 or i%5==0 or i%7==0:
        print(i)
    i = i+1
    f.write(str(i)+'\n')
f.close()